# Hub Get Point Id Method

Source: https://www.revitapidocs.com/2026/44e3c170-0b89-863f-95b2-55fafc5f2001.htm

---

| Hub Get Point Id Method |
| --- |

Returns ElementId of the associated Point element.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId GetPointId()
```

```
Public Function GetPointId As ElementId
```

```
public:
ElementId^ GetPointId()
```

```
member GetPointId : unit -> ElementId
```

#### Return Value

ElementId
Returns the Point element Id or invalidElementId if there is no Hub assciated with this point. See Also

#### Reference

Hub Class Autodesk.Revit.DB.Structure Namespace